# # MESSAGE_START_INTRO = '''
# # سلام و عرض ادب خدمت مراجع محترم.🙋‍♂️
# # مشاور بات برای کمک به شما اینحاست تا کار مشاوره سریع تر و راحت تر انجام شود.
# # '''
# MESSAGE_FIELD_CHOOSE = '''
# برای شروع مشاوره لطفا با توجه به مشکل خود یکی از موارد را انتخاب کنید: 👇
# '''
# MOSHAVERE_FIELDS = ['طب و سلامت','روانشناختی و اختلالات','ازدواج و خانواده','تربیت','اخلاق','اعتقادی','احکام','امور معنوری و ماورایی']
# MESSAGE_HEALTH_FIELDS_CHOOSE = '''
# در زمینه طب اسلامی در صورتی که نیاز به ارتباط با مشاور دارید گزینه مربوط در صورتی که نیاز به دسترسی به دستورات طبی گزینه آن را انتخاب کنید 👨‍
# '''
# MESSAGE_HEALTH_SUB_FIELD = '''
# دستورات در شاخه طب و سلامت به دسته های زیر تقسیم بندی می شود. برای نمایش آنها کلیک کنید: 👇
# '''
# HEALTH_FIELDS = ['مشاوره طبی','دستورات طبی']
# MESSAGE_NOT_PERMITTED_USER = '''
# ضمن عرض پوزش ظاهرا شما در سامانه ما اطلاعات خود را ثبت نکرده اید. لذا بایستی از طریق لینک زیر اطلاعات خود را ثبت نمایید. 👇
# پس از ثبت نام بات مشاوره در خدمت شما خواهد بود. 🙏
# '''
BUTTON_HOME_PAGE = "🏠 صفحه اصلی"
# MESSAGE_CHOICE_NOT_PERMITTED = '''
# متن وارد شده جزو گزینه های مورد نظر نیست. 😢
# '''
# MESSAGE_USER_ALREADY_SUBMITTED = '''
# خوشبختانه شما قبلا در سیستم ثبت نام کرده اید لزومی به ثبت نام جدید نیس میتوانید از ربات استفاده کنید. 😢
# '''
# START_BUTTON = "/start"
# ADVICE_CHOICE_CASE = "✍️"
# BASE_KEYBOARD = [
#     [BUTTON_HOME_PAGE]
# ]
WELCOME_MESSAGE = """
با سلام و احترام به بات تلگرام cisco with me خوش آمدید. 🙋‍♂️ 
"""
START_BUTTON = "شروع/"
START_EXAM_BUTTON = "شروع آزمون شبکه/"
# Get info questions
INFO_QUESTIONS = [
    ("phone",
     """
     📱 لطفا شماره موبایل خود را وارد کنید:  
        مثال: 09123456789
     """
     ),
    ("suggester",
     """
      💡 لطفا user id کسی را که به شما این بات را معرفی کرده وارد کنید:  
        مثال: @ciscoWithMe
     """
     ),
]
