# # MESSAGE_START_INTRO = '''
# # سلام و عرض ادب خدمت مراجع محترم.🙋‍♂️
# # مشاور بات برای کمک به شما اینحاست تا کار مشاوره سریع تر و راحت تر انجام شود.
# # '''
# MESSAGE_FIELD_CHOOSE = '''
# برای شروع مشاوره لطفا با توجه به مشکل خود یکی از موارد را انتخاب کنید: 👇
# '''
# MOSHAVERE_FIELDS = ['طب و سلامت','روانشناختی و اختلالات','ازدواج و خانواده','تربیت','اخلاق','اعتقادی','احکام','امور معنوری و ماورایی']
# MESSAGE_HEALTH_FIELDS_CHOOSE = '''
# در زمینه طب اسلامی در صورتی که نیاز به ارتباط با مشاور دارید گزینه مربوط در صورتی که نیاز به دسترسی به دستورات طبی گزینه آن را انتخاب کنید 👨‍
# '''
# MESSAGE_HEALTH_SUB_FIELD = '''
# دستورات در شاخه طب و سلامت به دسته های زیر تقسیم بندی می شود. برای نمایش آنها کلیک کنید: 👇
# '''
# HEALTH_FIELDS = ['مشاوره طبی','دستورات طبی']
# MESSAGE_NOT_PERMITTED_USER = '''
# ضمن عرض پوزش ظاهرا شما در سامانه ما اطلاعات خود را ثبت نکرده اید. لذا بایستی از طریق لینک زیر اطلاعات خود را ثبت نمایید. 👇
# پس از ثبت نام بات مشاوره در خدمت شما خواهد بود. 🙏
# '''
BUTTON_HOME_PAGE = "🏠 صفحه اصلی"
# MESSAGE_CHOICE_NOT_PERMITTED = '''
# متن وارد شده جزو گزینه های مورد نظر نیست. 😢
# '''
# MESSAGE_USER_ALREADY_SUBMITTED = '''
# خوشبختانه شما قبلا در سیستم ثبت نام کرده اید لزومی به ثبت نام جدید نیس میتوانید از ربات استفاده کنید. 😢
# '''
# START_BUTTON = "/start"
# ADVICE_CHOICE_CASE = "✍️"
# BASE_KEYBOARD = [
#     [BUTTON_HOME_PAGE]
# ]
WELCOME_MESSAGE = """
با سلام و احترام به بات تلگرام cisco with me خوش آمدید. 🙋‍♂️ 
"""
START_BUTTON = "🏠 شروع"
#شروع
START_EXAM_BUTTON = "💡 شروع آزمون شبکه"
#شروع آزمون شبکه
NOT_COMPELETED_INFO = "❌ متاسفانه اطلاعات شما کامل نیست. لطفا دوباره شروع کنید."
ALREADY_SUBMITTED = "✅ شما قبلا ثبت نام کرده اید لطفا دکمه شروع آزمون را بزنید موفق باشید"
PREPARING_QUESTIONS = "📝 در حال آماده‌سازی سوالات..."
FAILED_FETCH_DATA = "❌ فعلا قادر به در دریافت اطلاعات نیستیم 😢"
GRADE_A_MESSAGE = "🌟 عالی بود! تو یکی از بهترینایی! ادامه بده 👏"
GRADE_B_MESSAGE = "👏 خیلی خوب بود! یه کم دیگه تلاش کن می‌تونی عالی‌تر باشی."
GRADE_C_MESSAGE = "👍 قابل قبوله، ولی حتما می‌تونی بهتر از این باشی!"
GRADE_S_MESSAGE = "👏 آفرین خوب تونستی بات رو شیر کنی 💪"
SHARE_SUGGESTION = "یادت باشه همیشه میتونی بدرخشی. برای اینکه بتونی تو بالا رفتن اطلاعات دیگه کمک کنی و همینطور تخفیف 30 درصدی بگیری میتونی پیام زیر رو براشون بفرستی. "
END_EXAM_WITHOUT_OFF = "👏 آفرین که با آزمون دادنت دانش ات رو افزایش میدی میتونی باز شروع آزمون رو بزنی 💪\n"
CALLENDER_FAILED = "❌ مشکلی در ارتباط با تقویم پیش آمده است."
COUNTRY_FAILED = "❌ انتخاب کشور با مشکل روبه رو شده است."
STATE_FAILED = "❌ انتخاب استان با مشکل روبه رو شده است."
CITY_FAILED = "❌ انتخاب شهر با مشکل روبه رو شده است."
COMPLETE_INFO = "👏 آفرین خوب تونستی اطلاعات ات رو کامل کنی 💪"
CHECK_SHARE_COUNT = "🔍 چک کردن تعداد به اشتراک گذاری"
NOT_ENOUGH_SHARE_COUNT = "❌ متاسفانه تعداد به اشتراک گذاری شما به 3 مرتبه نرسیده است 😢 باز به پخش کردن ادامه بده"
ENOUGH_SHARE_COUNT = "✅ تعداد به اشتراک گذاری شما به حد نصاب رسیده است. باز به اشتراک گزاری ادامه دهید که بتوانید بار دیگر کد تخفیف دریافت کنید. کد تخفیف زیر خدمت شما: "
END_EXAM_TIME = "⏰ زمان آزمون به پایان رسید.\n"
GET_STATIC_INFO_BUTTON = "📝 دریافت اطلاعات"
CONFIRM_STATIC_INFO = "اطلاعات شما با موفقیت ثبت شد 👏"
FAILED_CODE_MELLI = "کد ملی شما به درستی وارد نشده است ❌ "
FULL_INFO_QUESTIONS = """لطفا نام (بدون نام خانوادگی) خود را وارد نمایید: 
لطفا نام خانوادگی خود را وارد نمایید: 
لطفا کد ملی خود را وارد نمایید: 
لطفا ایمیل خود را وارد نمایید: 
لطفا تاریخ تولد خود را انتخاب کنید: 
لطفا کشور محل زندگی خود را انتخاب کنید: 
لطفا استان محل سکونت خود را انتخاب کنید: """
# Get info questions
INFO_QUESTIONS = [
    ("phone",
     """
     📱 لطفا شماره موبایل خود را وارد کنید:  
        مثال: 09123456789
     """
     ),
    ("suggester",
     """
      💡 لطفا user id کسی را که به شما این بات را معرفی کرده وارد کنید:  
        مثال: @ciscoWithMe
     """
     ),
]
def share_bot_template(suggester):
    return f"""
    سلام و خداقوت  👏
    من {suggester} هستم میخوام ربات زیر رو بهت پیشنهاد کنم میتونی توش تست های مربوط به دوره های سیسکو بزنی و کلی چیز یاد بگیری همچنین اگه آزمون رو خوب بودی تخفیف خوبی رو دوره های سایت میگیری پس امتحانش کن 😎
    @ciscoWithMe 
    """
